{
    "recipes": [
        {
            "recipeID": 0,
            "title": "title",
            "description": "description",
            "size": "",
            "ingredients": "ingredients",
            "time": 2,
            "method": "method",
            "difficulty": "difficulty"
        },
        {
            "recipes": [
                {
                    "recipeID": 0,
                    "title": "Sausage & mushroom ragu",
                    "description": "Do something different with sausages and transform them into this veg-packed ragu. Great for a family dinner, serve with couscous, mash or pasta",
                    "size": "4",
                    "ingredients": [
                        "2 tbsp olive oil",
                        "1 carrot, grated",
                        "3 spring onions, finely chopped",
                        "2 garlic cloves, grated",
                        "large handful of mushrooms, finely chopped or grated",
                        "1 tsp dried oregano",
                        "1 tsp fennel seeds",
                        "6 pork sausages, squeezed out of their skins",
                        "400g can chopped tomatoes",
                        "1 tbsp tomato ketchup",
                        "mash, pasta or couscous, to serve"
                    ],
                    "time": 35,
                    "method": "STEP 1: Heat the oil in a saucepan over a medium heat and tip in the carrot, spring onions, garlic, mushrooms, oregano and fennel, along with a pinch of salt. Cook for about 5 mins.\nSTEP 2: Add the sausagemeat and cook until browned all over, then add the chopped tomatoes and ketchup, along with a pinch of salt and 100ml water. Reduce the heat to low, cover and cook until the sauce is thick, about 20 mins, stirring now and again. Season to taste, then serve with buttery mashed potato, pasta or couscous.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/sausage-mushroom-ragu"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 1,
                    "title": "Sloppy joes",
                    "description": "Sloppy joes are a simple, American staple the whole family can get stuck into. Add a dash of spicy chipotle or smoky barbecue sauce to the minced beef filling for some zing.",
                    "size": "6",
                    "ingredients": [
                        "1 tbsp vegetable oil",
                        "1 onion , finely chopped",
                        "2 small red peppers or yellow peppers, finely chopped",
                        "2 garlic cloves , crushed",
                        "400g minced beef",
                        "2 x 400ml cans chopped tomatoes",
                        "2 tbsp chipotle or smoky barbecue sauce",
                        "4 cheese slices",
                        "6 burger buns",
                        "crispy onions , to serve",
                        "iceberg lettuce , to serve"
                    ],
                    "time": 35,
                    "method": "STEP 1: Heat the oil in a deep frying pan, then fry the onion, pepper and garlic for 8-10 mins until softened. Add the mince, breaking it up with a wooden spoon as you go, and stir until it browns all over. Tip in the tomatoes and chipotle, or barbecue sauce, and add a little seasoning. Simmer for 10-15 mins until the sauce has thickened.\nSTEP 2: Put the cheese slices on top of the mince and cover with a lid for 2 mins to let it melt into the sauce. Pile into the buns with the crispy onions, and lettuce on the side for scooping up the extra sauce.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/diner-sloppy-joes"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 2,
                    "title": "Peanut butter chicken",
                    "description": "The whole family will love this new, budget chicken dish. Any leftovers freeze well and make a handy lunch",
                    "size": "4",
                    "ingredients": [
                        "2tbsp vegetable oil",
                        "8 skinless boneless chicken thighs, cut into chunks",
                        "1 onion,  finely chopped",
                        "3 garlic cloves, crushed",
                        "2 red chillies, finely sliced (deseeded if you don't like it too hot)",
                        "2tsp fresh ginger, grated",
                        "2tbsp garam masala",
                        "100g smooth peanut butter",
                        "400ml coconut milk",
                        "400g can chopped tomatoes",
                        "coriander , ½ roughly chopped, ½ leaves picked",
                        "roasted peanuts, to serve",
                        "cooked basmati rice, to serve"
                    ],
                    "time": 50,
                    "method": "STEP 1: Heat 1 tbsp of the oil in a deep frying pan over a medium heat. Brown the chicken in batches, setting aside once golden. Fry the onion for 8 minutes until softened. Then add the garlic, chilli and ginger and fry in the other 1 tbsp oil for 1 min. Add the garam masala and fry for 1 min more.\nSTEP 2: Stir in the peanut butter, coconut milk and tomatoes, and bring to a simmer. Return the chicken to the pan and add the chopped coriander. Cook for 30 mins until the sauce thickens and the chicken is cooked through.\nSTEP 3: Serve with the remaining coriander, roasted peanuts and rice, if you like.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/peanut-butter-chicken"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 3,
                    "title": "Lemon & greens pesto pasta",
                    "description": "Prep, cook and serve this quick and easy lemon and green veg pasta in just 15 minutes. It's perfect for busy days, and will be loved by the whole family",
                    "size": "4",
                    "ingredients": [
                        "350g pasta (we used linguine)",
                        "½ small head of broccoli, cut into florets",
                        "large handful of basil",
                        "1 large handful of  spinach wilted in boiling water, cooled and excess water squeezed out",
                        "4 tbsp pine nuts",
                        "1 garlic clove, grated",
                        "½ lemon, zested and juiced",
                        "6 tbsp extra virgin olive oil",
                        "large handful of frozen peas, set aside in boiled water until heated through",
                        "3 tbsp grated parmesan or vegetarian hard cheese",
                        "3 tbsp soft cheese"
                    ],
                    "time": 15,
                    "method": "STEP 1: Cook the pasta following pack instructions. Meanwhile, cook the broccoli for 4 mins in boiling salted water. Drain, then put in a food processor along with the basil, spinach and pine nuts. Pulse until combined.\nSTEP 2: Stir in the garlic, lemon zest and juice, olive oil, peas, parmesan and soft cheese, and season to taste.\nSTEP 3: Drain the pasta, reserving a little of the cooking water. Return the pasta to the pan and add the pesto along with a splash of water to loosen. Toss together, check the seasoning and serve.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/lemon-greens-pesto-pasta"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 4,
                    "title": "Orzo & tomato soup",
                    "description": "Make our simple, budget-friendly tomato, orzo and chickpea soup in just 30 minutes. This easy, vegetarian family meal is healthy and even low fat",
                    "size": "4",
                    "ingredients": [
                        "2 tbsp olive oil",
                        "1 onion, chopped",
                        "2 celery sticks, chopped",
                        "2 garlic cloves, crushed",
                        "1 tbsp tomato purée",
                        "400g can chopped tomatoes",
                        "400g can chickpeas",
                        "150g orzo pasta",
                        "700ml vegetable stock",
                        "2 tbsp basil pesto",
                        "crusty bread, to serve"
                    ],
                    "time": 30,
                    "method": "STEP 1: Heat 1 tbsp olive oil in a large saucepan. Add the onion and celery and fry for 10-15 mins, or until starting to soften, then add the garlic and cook for 1 min more. Stir in all the other ingredients, except for the pesto and remaining oil, and bring to the boil.\nSTEP 2: Reduce the heat and leave to simmer for 6-8 mins, or until the orzo is tender. Season to taste, then ladle into bowls.\nSTEP 3: Stir the remaining oil with the pesto, then drizzle over the soup. Serve with chunks of crusty bread.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/orzo-tomato-soup"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 5,
                    "title": "Summer fish stew",
                    "description": "This storecupboard fish stew is bulked out with bread and is full of fresh, summer flavours",
                    "size": "4",
                    "ingredients": [
                        "4 slices stale bread , diced",
                        "2 tbsp olive oil",
                        "1 onion , finely chopped",
                        "2 garlic cloves , crushed",
                        "1 tsp dried chilli flakes",
                        "400g can chopped tomatoes",
                        "4 frozen white fish fillets, such as cod or pollock",
                        "400g can butter beans , drained",
                        "small pack parsley , roughly chopped",
                        "1 lemon , cut into wedges"
                    ],
                    "time": 35,
                    "method": "STEP 1: Heat oven to 200C/180C fan/gas 6. Put the bread on a large baking sheet, drizzle over 1 tbsp oil and bake for 10 mins until golden. Set aside.\nSTEP 2: Meanwhile, heat the rest of the oil in a large flameproof casserole dish over a medium heat. Add the onion and cook until softened for about 10 mins, then add the garlic and chilli flakes and stir for 1 min. Tip in the tomatoes and fish fillets. Cover and simmer for 10 mins until the fish is nearly cooked, then uncover.\nSTEP 3: Tip in the butter beans, season well, then cook until everything is hot. Serve scattered with the croutons, parsley and lemon.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/summer-fish-stew"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 6,
                    "title": "Chestnut mushroom, fennel & bacon fusilli",
                    "description": "Store cupboard ingredients, spices and seasonal veg make this recipe the tastiest way to get 3 of your 5 a day",
                    "size": "4",
                    "ingredients": [
                        "50ml olive oil , plus 1 tbsp",
                        "2 fennel bulbs , finely sliced",
                        "2 onions , finely sliced",
                        "4 garlic cloves , crushed",
                        "2 red chillies , deseeded and finely sliced",
                        "4 tbsp tomato purée",
                        "250g pack streaky bacon , diced",
                        "350g fusilli",
                        "280g baby chestnut mushrooms , sliced",
                        "small pack parsley , roughly chopped, to serve",
                        "parmesan , grated, to serve"
                    ],
                    "time": 45,
                    "method": "STEP 1: Bring a large saucepan of salted water to the boil. Heat 1 tbsp oil in a large pan over a medium heat and fry the fennel and onion for 15 mins, or until softened. Add the garlic and chilli, and cook for 1 min, then add the tomato purée and stir for 1 min more. Toss in the bacon and fry for 5-6 mins.\nSTEP 2: Meanwhile, cook the pasta according to pack instructions. Add the mushrooms to the frying pan, stir and cover for 8 mins, or until the mushrooms are soft.\nSTEP 3: Drain the pasta, adding a ladle of the cooking water to the sauce. Tip in the pasta and stir to coat. Add the rest of the oil and scatter over the parsley and Parmesan.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/chestnut-mushroom-fennel-bacon-fusilli"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 7,
                    "title": "Cheat’s beetroot biriyani",
                    "description": "Cook this beetroot biriyani and freeze the leftovers for busy weeknights. With colourful beetroot taking centre stage, it's full of spices and is a flavourful dish",
                    "size": "4",
                    "ingredients": [
                        "3 large (500g unprepped), raw  beetroot , peeled and cut into 2cm cubes",
                        "2 tbsp rapeseed oil",
                        "1 large  onion , finely sliced",
                        "thumb-sized piece of  ginger , grated",
                        "2 small  garlic cloves , crushed",
                        "1 bay leaf",
                        "4 cardamom pods",
                        "2 tsp turmeric",
                        "2 tbsp garam masala",
                        "250g basmati rice , rinsed",
                        "500ml low-salt  veg stock",
                        "100ml fat-free  yogurt",
                        "small bunch of  coriander",
                        "your favourite chutney or pickle, to serve (optional)"
                    ],
                    "time": 65,
                    "method": "STEP 1: Heat the oven to 200C/180C fan/gas 6. Toss the beetroot with half the oil and some seasoning, then tip into a roasting dish and cook for 25-30 mins, tossing halfway through, until tender.\nSTEP 2: Meanwhile, heat the remaining oil in a large, shallow casserole dish or ovenproof frying pan. Fry the onion over a medium heat for 10 mins until golden. Add the ginger and half the garlic, and cook for 1 min. Stir through the bay, cardamom pods, turmeric and garam masala, then cook for 2 mins. Stir in the rice and beetroot, then season. Pour in the stock and bring to the boil.\nSTEP 3: Put in the oven, uncovered, and cook for 20-25 mins until the rice is cooked through. Give it a stir when it’s out of the oven.\nSTEP 4: Put the yogurt, coriander and remaining garlic in a food processor and whizz until smooth. Season to taste. Serve the biriyani with the coriander yogurt and pickle.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/cheats-beetroot-biriyani"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 8,
                    "title": "Halloumi & watermelon bulgur salad",
                    "description": "A satisfying vegetarian salad of contrasting flavours and textures. The salty cheese is cooled by crisp, sweet watermelon",
                    "size": "4",
                    "ingredients": [
                        "200g bulgur wheat",
                        "50g pumpkin seed",
                        "3 tbsp olive or  rapeseed oil",
                        "250g pack  halloumi cheese , cut into 10-12 slices",
                        "1 cucumber , halved lengthways, seeds scooped out and cut into chunks",
                        "large bunch either  parsley , mint, coriander or basil, or a mixture, chopped, reserving a few leaves to serve",
                        "zest and juice 2  lemons",
                        "¼ watermelon , cut into chunks, or a 400g pack ready-prepared"
                    ],
                    "time": 30,
                    "method": "STEP 1: Boil the kettle. Put the bulgur wheat in a bowl with some seasoning, pour over enough hot water to just cover, then cover with cling film and set aside to absorb the liquid while you prepare the remaining ingredients.\nSTEP 2: Heat a large frying pan and add the pumpkin seeds, toast for a few mins until the seeds start to crackle and pop, then tip into a dish and set aside. Heat a drizzle of oil in the pan. Add the halloumi slices and fry for 2-3 mins on each side or until golden.\nSTEP 3: Unwrap the bulgur wheat and check that it is tender (if not, re-cover and leave for another 5 mins). All the water should have been absorbed, but if not, drain the excess. Add the remaining oil, the cucumber, herbs, lemon zest and juice, and pumpkin seeds to the bulgur wheat and toss well. Transfer to a platter, top with the watermelon and halloumi, and scatter with the reserved herbs.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/halloumi-watermelon-bulghar-salad"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 9,
                    "title": "Pork & apple burgers",
                    "description": "Our budget-friendly pork and apple burgers are perfect for an easy and delicious family supper. This easy midweek meal takes just ten minutes to prepare",
                    "size": "4",
                    "ingredients": [
                        "300g sausagemeat",
                        "4 wholemeal burger buns",
                        "4 tsp onion marmalade",
                        "2 apples , cored and thinly sliced",
                        "2 handfuls rocket",
                        "2 tsp mayonnaise",
                        "a little English English mustard (optional)",
                        "sweet potato wedges , to serve (optional)"
                    ],
                    "time": 25,
                    "method": "STEP 1: Divide the sausagemeat into four portions and shape into patties. Fry in a non-stick pan for 10-12 mins, flipping a couple of times, until golden on both sides and cooked all the way through.\nSTEP 2: Heat grill to high. Slice the buns in half and toast under the grill, cut-side up.\nSTEP 3: Spread the bottom halves of the toasted buns with the marmalade, then add the burgers, apple slices, rocket, mayonnaise and mustard (if using). Top with the bun lids and serve alongside sweet potato wedges, if you like.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/pork-apple-burgers"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 10,
                    "title": "Sausage ragu",
                    "description": "Feed the family this comforting, budget-friendly sausage ragu with pasta. You can freeze the leftovers for another time and it tastes just as good",
                    "size": "4",
                    "ingredients": [
                        "3 tbsp olive oil",
                        "1 onion, finely chopped",
                        "2 large garlic cloves, crushed",
                        "¼ tsp chilli flakes",
                        "2 rosemary sprigs, leaves finely chopped",
                        "2 x 400g cans chopped tomatoes",
                        "1 tbsp brown sugar",
                        "6 pork sausages",
                        "150ml whole milk",
                        "1 lemon, zested",
                        "350g rigatoni pasta",
                        "grated parmesan and ½ small bunch parsley, leaves roughly chopped, to serve"
                    ],
                    "time": 50,
                    "method": "STEP 1: Heat 2 tbsp of the oil in a saucepan over a medium heat. Fry the onion with a pinch of salt for 7 mins. Add the garlic, chilli and rosemary, and cook for 1 min more. Tip in the tomatoes and sugar, and simmer for 20 mins.\nSTEP 2: Heat the remaining oil in a medium frying pan over a medium heat. Squeeze the sausagemeat from the skins and fry, breaking it up with a wooden spoon, for 5-7 mins until golden. Add to the sauce with the milk and lemon zest, then simmer for a further 5 mins. To freeze, leave to cool completely and transfer to large freezerproof bags.\nSTEP 3: Cook the pasta following pack instructions. Drain and toss with the sauce. Scatter over the parmesan and parsley leaves to serve.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/sausage-ragu"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 11,
                    "title": "Super smoky bacon & tomato spaghetti",
                    "description": "Serve your pasta with a budget-busting tomato and paprika sauce. It's a healthy choice to boot",
                    "size": "4",
                    "ingredients": [
                        "400g spaghetti",
                        "1 tbsp olive oil",
                        "120g smoked streaky bacon, sliced into matchsticks",
                        "1 onion, finely chopped",
                        "1 garlic clove, finely chopped",
                        "2 tsp sweet smoked paprika",
                        "2 x 400g cans chopped tomatoes",
                        "grated parmesan, to serve (optional)"
                    ],
                    "time": 25,
                    "method": "STEP 1: Bring a large pan of water to the boil and cook the spaghetti following pack instructions. Meanwhile, heat the oil in a large non-stick frying pan and cook the bacon for 3-4 mins until just starting to crisp. Stir in the onion and cook for another 3-4 mins, then add the garlic and smoked paprika, and cook for 1 min more.\nSTEP 2: Pour in the chopped tomatoes, bring to the boil and bubble for about 5 mins until thickened, stirring every so often to stop it catching on the bottom. Drain the pasta and toss with the sauce. Serve with Parmesan, if you like.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/super-smoky-bacon-tomato-spaghetti"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 12,
                    "title": "Pizza baked potato",
                    "description": "This budget-friendly supper combines two favourites in one dish. Top your jacket spuds with cheese, tomato, pepperoni and basil",
                    "size": "4",
                    "ingredients": [
                        "4 baking potatoes",
                        "1 tbsp olive oil",
                        "½ red onion , finely chopped",
                        "1 garlic clove , crushed",
                        "60g pack sliced pepperoni , torn",
                        "400g can chopped tomato",
                        "½ small pack  basil leaves , shredded",
                        "100g grated mozzarella"
                    ],
                    "time": 150,
                    "method": "STEP 1: Heat oven to 200C/180C fan/gas 6. Scrub the potatoes and dry well, then prick several times with a fork. Bake directly on the oven shelf for 1-1½ hrs, until they feel soft. If you are short of time, prick each potato with a fork, wrap in a sheet of kitchen paper and microwave on High for 8-10 mins until soft inside.\nSTEP 2: While the potatoes cook, heat the oil in a small pan and sauté the onion for 5 mins to soften. Stir in the garlic and pepperoni, and cook for 1-2 mins, then add the chopped tomatoes. Bring to the boil, then simmer for 5 mins. Season and stir in half the basil. Spoon over the split potatoes and top each one with a good handful of cheese and the rest of the basil.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/pizza-baked-potato"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 13,
                    "title": "Spaghetti puttanesca",
                    "description": "Cook up this classic sauce in one pan, then toss with spaghetti for a simple midweek meal. It's budget-friendly too, making it a great meal for the family ",
                    "size": "4",
                    "ingredients": [
                        "3 tbsp olive oil",
                        "1 onion, finely chopped",
                        "2 large garlic cloves, crushed",
                        "½ tsp chilli flakes (optional)",
                        "400g can chopped tomatoes",
                        "5 anchovy fillets, finely chopped",
                        "120g pitted black olives",
                        "2 tbsp capers, drained",
                        "300g dried spaghetti",
                        "½ small bunch of parsley, finely chopped"
                    ],
                    "time": 35,
                    "method": "STEP 1: Heat the oil in a non-stick pan over a medium-low heat. Add the onion along with a generous pinch of salt and fry for 10 mins, or until soft. Add the garlic and chilli, if using, and cook for a further minute.\nSTEP 2: Stir the tomatoes, anchovies, olives and capers into the onion, bring to a gentle simmer and cook, uncovered, for 15 mins. Season to taste.\nSTEP 3: Meanwhile, bring a large pan of salted water to the boil. Cook the spaghetti following pack instructions, then drain and toss with the sauce and parsley.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/spaghetti-puttanesca"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 14,
                    "title": "Kedgeree with poached egg",
                    "description": "This curried fish and rice dish is suitable for brunch, breakfast or a main course at dinnertime. Replace traditional boiled eggs with poached",
                    "size": "4",
                    "ingredients": [
                        "300g long grain rice",
                        "2 tbsp olive oil",
                        "1 onion , finely chopped",
                        "2 garlic cloves , finely chopped",
                        "390g pack  fish pie mix, defrosted if frozen",
                        "1 heaped tbsp mild or medium curry powder",
                        "juice 1 lemon",
                        "¼ small pack  parsley , chopped",
                        "4 eggs"
                    ],
                    "time": 30,
                    "method": "STEP 1: Cook the rice following pack instructions, then drain and set aside. Meanwhile, heat 1 tbsp of the oil in a non-stick frying pan and cook the onion and garlic for 5 mins. Toss the fish pieces with the curry powder and remaining oil. Add to the pan. Cook for another 5 mins, stirring carefully and turning the fish.\nSTEP 2: Add the rice to the pan and turn up the heat, then stir well (the fish will break up a little). Cook for 1-2 mins, then stir in the lemon and parsley. Turn the heat down as low as it will go, and put on a lid.\nSTEP 3: Bring a pan of water to the boil, turn down the heat and poach the eggs. Season the kedgeree and divide between plates, topping each with a poached egg.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/kedgeree-poached-egg"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 15,
                    "title": "Spicy sausage & bean one-pot",
                    "description": "A saucy, warming casserole with Cumberland sausages, chilli gravy and kidney beans. It's budget-friendly and ready in less than 30 minutes too",
                    "size": "4",
                    "ingredients": [
                        "1 tbsp vegetable oil",
                        "1 onion , thickly sliced",
                        "8 Cumberland sausages",
                        "1 fat garlic clove , crushed",
                        "2 x 400g cans kidney beans in chilli sauce",
                        "2-3 sprigs curly parsley , chopped"
                    ],
                    "time": 25,
                    "method": "STEP 1: Heat the oil in a large frying pan. Cook the onion and sausages over a fairly high heat for 8-10 mins, turning the sausages often so they brown all over.\nSTEP 2: Add the garlic to the pan with the kidney beans and their sauce. Half-fill one of the cans with water, swirl and then add this to the pan. Stir everything together and bring to the boil. Turn down to simmer and cook for 10 mins, or until the sausages are cooked through. Season and sprinkle with the parsley.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/spicy-sausage-bean-one-pot"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 16,
                    "title": "Mushroom, ricotta & rocket tart",
                    "description": "This puff pastry slice requires minimum fuss. Use Italian cheese as a simple base and top with garlic mushrooms and salad leaves",
                    "size": "4",
                    "ingredients": [
                        "1 sheet ready-rolled puff pastry",
                        "2 tbsp olive oil",
                        "525g family pack mushroom , halved or quartered if large",
                        "2 garlic cloves , 1 finely sliced, 1 crushed",
                        "250g tub  ricotta",
                        "good grating of  nutmeg",
                        "¼ small pack parsley , leaves only, roughly chopped",
                        "50g rocket"
                    ],
                    "time": 35,
                    "method": "STEP 1: Heat oven to 220C/200C fan/gas 7 and place a baking sheet inside. Unroll the pastry onto a piece of baking parchment and score a border around the pastry about 1.5cm in from the edge. Place the pastry (still on the parchment) on the baking sheet and cook for 10-15 mins.\nSTEP 2: While the pastry bakes, heat the oil in a large lidded pan and cook the mushrooms for 2-3 mins, with the lid on, stirring occasionally. Remove the lid and add the sliced garlic, then cook for 1 min more to get rid of excess liquid.\nSTEP 3: Mix the crushed garlic with the ricotta and nutmeg, then season well. Remove the pastry from the oven and carefully push down the risen centre. Spread over the ricotta mixture, then spoon on the mushrooms and garlic. Bake for 5 mins, then scatter over the parsley and rocket.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/mushroom-ricotta-rocket-tart"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 17,
                    "title": "Spicy oven-baked chicken & chips",
                    "description": "A midweek budget supper of roast chicken wings with homemade chips and Cajun spices",
                    "size": "4",
                    "ingredients": [
                        "1 tbsp Cajun seasoning",
                        "2 tbsp vegetable oil",
                        "zest and juice 1  lime",
                        "750g large  potato , cut into chips",
                        "1kg chicken wing",
                        "green salad or coleslaw and  ketchup , to serve"
                    ],
                    "time": 50,
                    "method": "STEP 1: Heat oven to 200C/180C fan/gas 6. In a bowl, whisk together the Cajun seasoning, vegetable oil, lime zest and juice. Toss the chips, wings and Cajun mixture together in batches, so that everything is well coated.\nSTEP 2: Cover a large baking sheet with foil, then arrange the chips around the outside and the wings in the middle. Season and bake for 20 mins, then turn the chips and return to the oven for a further 20-25 mins until the chips and wings are golden. Serve with green salad, or coleslaw and ketchup.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/spicy-oven-baked-chicken-chips"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 18,
                    "title": "Oaty katsu chicken dippers",
                    "description": "Make a batch of these finger-lickin' chicken dippers for an easy and fun family meal. Serve with rice, salad and a peanut butter dipping sauce",
                    "size": "n",
                    "ingredients": [
                        "olive oil spray",
                        "2 tbsp cornflour",
                        "1 egg, beaten",
                        "100g porridge oats",
                        "½ tsp smoked paprika",
                        "½ tsp garlic granules",
                        "380g chicken mini fillets",
                        "1 tsp coconut oil",
                        "2 tsp mild curry powder",
                        "1 tsp garlic paste",
                        "1 tsp ginger paste",
                        "165ml can coconut milk",
                        "1 heaped tsp  dark roasted peanut butter",
                        "1 tsp honey",
                        "60ml apple juice",
                        "1 tsp cornflour,  mixed with 1 tsp water"
                    ],
                    "time": 20,
                    "method": "STEP 1: Heat the oven to 220C/200C fan/gas 7. Line a baking tray with foil and spray evenly with olive oil spray.\nSTEP 2: Put the cornflour on a small plate and season with salt and pepper. Put the beaten egg in a small bowl and season with salt. Put the oats on another plate and mix with the paprika and garlic granules. Dust the mini fillets in the cornflour, then dip them in the egg and finally roll the fillets in the oats to coat. Put them on the prepared baking tray.\nSTEP 3: Spray the top of the oaty dippers with an even coating of the oil spray and bake in the oven for 15-20 mins or until cooked through and golden on the outside.\nSTEP 4: While the chicken cooks, make the katsu sauce. Heat the coconut oil in a small saucepan over a medium heat, add the curry powder, and garlic and ginger pastes, and cook for 1 min until fragrant. Add the remaining sauce ingredients, except the cornflour, and heat through until hot. Whisk in the cornflour mixture and allow to thicken a little before removing from the heat. Serve the dippers with the sauce on the side.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/oaty-katsu-chicken-dippers"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 19,
                    "title": "Bhaji frittata",
                    "description": "This lunchbox or picnic-friendly dish takes an Italian-style thick omelette and adds some Indian spice, along with potatoes, peas and coriander",
                    "size": "4",
                    "ingredients": [
                        "2 tbsp vegetable oil",
                        "2 onions , thinly sliced",
                        "1 garlic clove , finely chopped",
                        "2 tsp mild  curry powder",
                        "450g potato , coarsely grated and any excess liquid squeezed out",
                        "6 medium eggs , beaten",
                        "100g frozen pea",
                        "small pack  coriander , roughly chopped",
                        "mango chutney, natural yogurt and naan bread , to serve (optional)"
                    ],
                    "time": 40,
                    "method": "STEP 1: Heat oven to 200C/180C fan/gas 6. Heat the oil in an ovenproof frying pan and fry the onion for about 10 mins over a medium heat until golden. Add the garlic and curry powder and cook for 1-2 mins.\nSTEP 2: Next, add the grated potatoes and cook for 5-8 mins, stirring occasionally. You want the potatoes to soften, but also catch a little and turn golden in patches. Season the eggs, then pour into the pan with the peas and most of the coriander, swirling to coat the potato mixture. Cook for 1 min more, then transfer to the oven for 10 mins until the eggs have set. Sprinkle with the remaining coriander and serve with mango chutney, natural yogurt and naan bread, if you like.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/bhaji-frittata"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 20,
                    "title": "Tuna & sweetcorn fish cakes",
                    "description": "Tinned fish and sweetcorn are a lifesaver when you need to rustle up some simple potato patties for a healthy, budget-friendly supper",
                    "size": " ",
                    "ingredients": [
                        "450g potato , quartered",
                        "2 tbsp mayonnaise , plus extra to serve",
                        "2 x 185g cans  tuna , drained",
                        "198g can  sweetcorn , drained",
                        "small bunch chives , snipped, or 1 tsp dried parsley",
                        "2 eggs , beaten",
                        "100g dried breadcrumb",
                        "sunflower oil , for frying",
                        "salad and your favourite dressing, to serve"
                    ],
                    "time": 40,
                    "method": "STEP 1: Cook the potatoes in boiling salted water until really tender. Drain and allow to steam-dry in a colander. Tip into a bowl, season and mash. Stir in the mayonnaise, tuna, sweetcorn and chives or parsley. Shape into 4 cakes and chill until cold and firm.\nSTEP 2: Dip each cake into the egg, letting the excess drip off, then coat in the breadcrumbs. Chill for 15 mins.\nSTEP 3: Heat a little of the oil in a pan and gently fry the cakes for 2-3 mins on each side until golden. You may need to do this in batches – keep warm in a low oven. Serve with extra mayonnaise and salad leaves.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/raid-cupboard-tuna-sweetcorn-cakes"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 21,
                    "title": "Lamb & chickpea fritter wraps",
                    "description": "Spiced lamb and chickpea patties with yogurt, coriander and salad make the perfect filling for flatbread",
                    "size": "4",
                    "ingredients": [
                        "1 x 400g and 1 x 210g can  chickpea , drained and rinsed",
                        "1 egg",
                        "250g pack lean lamb mince",
                        "1 tsp ground cumin",
                        "1 tsp ground coriander",
                        "¼ tsp ground cinnamon",
                        "3 garlic cloves , crushed",
                        "1 red chilli , deseeded and finely chopped",
                        "¼ small pack  coriander , roughly chopped",
                        "1 tbsp olive oil",
                        "4 large tortilla wraps",
                        "1 romaine lettuce , shredded",
                        "4 tomatoes , sliced",
                        "1 small  red onion , thinly sliced",
                        "150g pot 0% fat  Greek yogurt",
                        "oven chips , to serve (optional)"
                    ],
                    "time": 35,
                    "method": "STEP 1: In a food processor, whizz the chickpeas with the egg for a few mins until almost a purée, but some bits remain. Spoon into a bowl and stir in the mince, spices, two-thirds of the garlic, the chilli and coriander. Season well and form into 12 small fritters.\nSTEP 2: Heat the oil in a non-stick frying pan and cook the fritters in batches for 4 mins on each side, until crisp on the outside and cooked through.\nSTEP 3: Top each wrap with a good handful of shredded lettuce, tomato, red onion and 3 fritters. Mix the yogurt with the remaining garlic and spoon a little over the fritters. Wrap up and tuck in, with chips on the side, if you like.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/lamb-chickpea-fritter-wraps"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 22,
                    "title": "Mixed-bean chilli with wedges",
                    "description": "A warming bowl of meat-free comfort food. Make extra for the freezer",
                    "size": "4",
                    "ingredients": [
                        "4 medium baking potatoes, unpeeled, each cut into 8 wedges",
                        "4 tsp olive oil",
                        "1 red onion, roughly chopped",
                        "1 yellow pepper",
                        "1 tbsp Cajun spice mix",
                        "2 x 410g/14oz cans mixed pulses in water, rinsed and drained",
                        "400g can chopped tomatoes",
                        "150ml vegetable stock",
                        "1 tbsp dark chocolate, chopped",
                        "4 tbsp reduced-fat soured cream"
                    ],
                    "time": 50,
                    "method": "STEP 1: Heat oven to 220C/200C fan/gas 7. Toss the potato wedges in 2 tsp oil and spread out in a single layer on a large baking tray. Cook for 30-35 mins, turning halfway, until tender and golden brown.\nSTEP 2: Meanwhile, for the chilli, put the remaining oil into a casserole dish and fry the onion and pepper for 5 mins. Add Cajun spice, pulses, tomatoes and stock. Cover and simmer for 15-20 mins. Remove casserole from the heat and stir in the chocolate until melted. Ladle the chilli into bowls, top each with 1 tbsp soured cream and serve with the wedges.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/mixed-bean-chilli-wedges"
                }
            ]
        },
        {
            "recipes": [
                {
                    "recipeID": 23,
                    "title": "Crispy bacon & sausage carbonara",
                    "description": "Eggs, bacon and sausage - not a breakfast plate, but a delicious budget pasta dish with creamy sauce and parsley",
                    "size": "4",
                    "ingredients": [
                        "400g penne",
                        "4 sausages",
                        "8 slices  streaky bacon or pancetta",
                        "1 onion , finely chopped",
                        "3 large egg yolks",
                        "4 tbsp single cream",
                        "85g parmesan , finely grated",
                        "small bunch parsley , finely chopped"
                    ],
                    "time": 25,
                    "method": "STEP 1: Cook the pasta following pack instructions. Meanwhile, squeeze the meat out of the sausage casings and, with damp or lightly oiled hands, roll into small-ish balls.\nSTEP 2: Heat a frying pan and cook the bacon or pancetta until really crispy. Remove and keep warm. Fry the sausageballs until golden and cooked through, remove and keep warm (a low oven is good for this). Cook the onion in the fat from the bacon and sausageballs (tip some out if you need to) until soft.\nSTEP 3: In a small bowl, mix the egg yolks, cream, most of the Parmesan and most of the parsley with lots of black pepper and a pinch of salt. Drain the pasta, reserving a ladle of water. Tip the pasta back into the pan, off the heat, and add the egg mix, onions and sausageballs. Mix well, adding some pasta water until you have a sauce that coats the pasta. Tip into bowls, scatter over the remaining parsley and Parmesan, and top with the bacon.\n",
                    "difficulty": "Easy",
                    "url": "https://www.bbcgoodfood.com/recipes/crispy-bacon-sausage-carbonara"
                }
            ]
        }
    ]
}